Repository: pyplan/pyplan
Catalog: docs/locale/*/LC_MESSAGES/14_office_addin/index.po
Languages: zxx

source: Complemento de Office
zxx: Office Add-in

source: Introducción
zxx: Introduction

source: En esta sección se detalla cómo puedes utilizar el complemento de office para comunicarte con tu aplicación en Pyplan.
zxx: This section details how you can use the office add-in to communicate with your Pyplan application.

source: Instalación
zxx: Installation

source: Para agregar el complemento de Pyplan, despliega la lista de complementos y utiliza el buscador. Luego seleccionas **Pyplan for Microsoft 365** y confirmas la instalación.
zxx: To add the Pyplan add-in, open the list of add-ins and use the search box. Then select **Pyplan for Microsoft 365** and confirm the installation.

source: Inicio de sesión
zxx: Login

source: Para iniciar sesión en una instancia de Pyplan, primero deberás registrar dicha instancia. Para realizar esto sigue los siguientes pasos:
zxx: To log in to a Pyplan instance, you must first register that instance. To do this, follow the steps below:

source: Click en el botón *Sign in*
zxx: Click on the *Sign in* button

source: Si es la primera vez que ingresas, deberás registrar la instancia a la cual deseas conectarte. Para esto haz click en el botón **+** y luego completa los datos de la instancia y luego click en confirmar.
zxx: If this is the first time you log in, you must register the instance you wish to connect to. To do this click on the **+** button and then fill in the instance data and click on confirm.

source: Conexión utilizando SSO
zxx: Connecting using SSO

source: Si vas a utilizar el inicio de sesión con SSO (Single Sign On), en la url deberás agregar /saml/[nombre de la empresa]. Ejemplo: https://dev.pyplan.com/saml/pyplan
zxx: If you are going to use SSO (Single Sign On) login, in the url you must add /saml/[company code]. Example: https://dev.pyplan.com/saml/pyplan

source: Una vez que registres la conexión, quedará disponible para próximos inicios de sesión. Luego has click en la conexión que desees utilizar e inicia sesión utilizando tus credenciales.
zxx: Once you register the connection, it will be available for future logins. Then click on the connection you wish to use and log in using your credentials.

source: Abrir una aplicación
zxx: Open an application

source: Luego de haber iniciado sesión podrás abrir alguna de las aplicaciones que tengas disponibles, tanto de tu espacio privado como del espacio público o de algún equipo de trabajo al cual pertenezcas.
zxx: After logging in, you will be able to open any of the applications you have available, either from your private space or from the public space or from a work team to which you belong.

source: Los **Node Links** son vínculos entre hojas de cálculo o rangos de Microsoft Excel y nodos de Pyplan. Estos vínculos te permiten enviar y recibir información hacia y desde tu aplicación de Pyplan.
zxx: **Node Links** are links between Microsoft Excel spreadsheets or ranges and Pyplan nodes. These links allow you to send and receive information to and from your Pyplan application.

source: Tipos de Node Links
zxx: Types of Node Links

source: Existen dos tipos de **Node Links**:
zxx: There are two types of **Node Links**:

source: salida de datos: permiten obtener datos desde Pyplan
zxx: data output: allow to obtain data from Pyplan

source: entrada de datos: permiten enviar datos hacia Pyplan
zxx: data input: allow to send data to Pyplan

source: Para crear un **Node Link** de salida de datos realiza los siguientes pasos:
zxx: To create a **Node Link** for data output perform the following steps:

source: Click en el botón **+**.
zxx: Click on the **+** button.

source: Selecciona el destino de los datos. Puede ser en la celda seleccionada o en una nueva hoja. En caso de que selecciones una nueva hoja, se creará una hoja con el ID del nodo de Pyplan.
zxx: Select the destination of the data. It can be in the selected cell or in a new worksheet. In case you select a new sheet, a sheet with the Pyplan node ID will be created.

source: Seleccionar el nodo de Pyplan desde el cual se obtendrán los datos. Todos los nodos son de salida de datos, excepto los nodos de tipo formulario.
zxx: Select the Pyplan node from which the data will be obtained. All nodes are data output nodes, except form type nodes.

source: Para crear un **Node Link** de entrada de datos realiza los mismos pasos anteriormente mencionados, pero selecciona un nodo de tipo formulario. Esto te permitirá modificar los valores de las celdas y luego enviar los datos a Pyplan. Para enviar los datos a Pyplan una vez modificadas las celdas de la tabla debes hacer click en el botono de **enviar datos**.
zxx: To create a data entry **Node Link** perform the same steps as above, but select a form type node. This will allow you to modify the cell values and then send the data to Pyplan. To send the data to Pyplan once the table cells have been modified you must click on the **send data** button.

source: Envío de datos
zxx: Sending data

source: Al enviar datos a Pyplan, se actualizará el nodo de tipo Formulario y si en el libro de Excel existen nodos que dependen del nodo actualizado, los mismos se actualizarán con el nuevo resultado. También puedes hacer una tabla dinámica tomando como base la tabla de salida de datos. Al actualizar el Node link también se actualizarán las tablas dinámicas.
zxx: When sending data to Pyplan, the Form node will be updated and if there are nodes in the Excel workbook that depend on the updated node, they will be updated with the new result. You can also make a pivot table based on the data output table. Updating the Node link will also update the pivot tables.
